{
	"ja":{
		"hint1":[
			"",
			"テーブルには急須が３つある。急須はタップすると回転するよ。それぞれ正しい向きがあるようだ。どこかに急須の向きを表しているものがあるはずだ。",
			"-",
			"急須の下には3つの絵とボタンがある。絵はタンスを表しているみたいだ。",
			"-",
			"タンスの引き出しからゲットしたロウソクに火をつけてみよう。炎がどこかにあったはず。",
			"小さい棚にはボタンが3つある。ボタンは黄色、赤、白の3つだね。これと同じ色のものが部屋のどこかにもないだろうか。",
			"小さい棚の引出しには小判がいっぱい入っている。それぞれの小判に描かれた絵柄は部屋のどこかでも見たはず。",
			"-",
			"白い和服の近くの壁にはあやしいところが。触ってみると人形が出てくるよ。何回も触ると色んな色の人形が出てくるね。",
			"ー",
			"白い和服の近くにある絵は扇子を表しているよ。部屋にある4つの扇子を絵のように左から##開く、閉じる、開く、閉じる##にしてみよう。",
			"扇子があるタンスの引出しから鍵をゲットしたら、部屋の扉を開けてみよう。",
			"弓道場近くの建物の扉にはボタンが3つある。ボタンの上にある緑色の絵が重要のようだ。似たようなものがどこかにないだろうか。",
			"鍛冶屋の中にはカゴの中に3本の刀が入っている。よく見るとツバの形が全部違うね。",
			"最初の建物のテーブルからロウソクをゲットしたら、どこかに火をつけたいね。火をつける場所を探してみよう。",
			"橋を渡って出口まで行くと扉近くに箱があるね。箱にはボタンがあってマークを合わせる必要があみたい。同じマークが描かれた場所を探してみよう。",
			"ー",
			"ー",
			"出口近くの箱からは刀をゲットできるよ。鞘から刀を抜くと刃はボロボロだ。このままでは何も切れない… どうにか刀を鍛えれないだろうか。",
			"刀を鍛えたから試しに何かを切ってみたい。どこかに刀で切れそうなものがないだろうか。",
			"ー",
			"竹の中からゲットした巻物を広げると絵が描かれている。この絵はお城の扉の鍵にあるボタンと形が似ているね。",
			"お城の２階には3種類の武器が飾ってある。武器を正しい位置に並び替える必要があるみたいだ。武器の順番を表しているものがどこかにないか探してみよう。",
			"お城の２階には傘が３つある。傘には三日月が描かれている。三日月と同じ形のものが他の場所でもあったはず。",
			"お城の３階には動物が描かれたボタンがある。たしか屏風にも動物が描かれていたはず。まずはお城にある屏風を全部開いてみよう。",
			"お城の３階には手裏剣が重なっているところがある。これまでにゲットした３つの手裏剣も置くことができるよ。手裏剣には正しい置き方があるようだ。",
			"鍵を使って階段にかかったチェーンの鍵を開けよう。",
			"お城の各階には窓がある。窓を全部開けてみよう。",
			"鍛冶屋にあるタンスの引き出しにはボタンが３つあって、ボタンの後ろには絵がある。絵はお城のようにも見えるね。",
			"お城の最上階にあるタンスには数字のボタンが3つある。どこかに数字が見える場所がないだろうか。例えばお城から見下ろす景色に・・・",
			"手に入れた弓と矢を組み合わせてみよう。",
			"弓道場の的に向かって矢を放ってみよう。",
			"的には矢が2本刺さっているね。刺さった位置が何か重要のようだ。",
			"タンスからゲットした桶に水を入れてみよう。水がある場所といえば。",
			"桶に入った水はどうやって使おう。火を消したりできるかも。",
			"外にある地図には人形が描かれたピンを置くことができるね。それぞれの人形がある場所に同じポーズのピンを置くといいみたいだ。まずは4つの人形を見つけよう。",
			"外にある地図には人形が描かれたピンを置くことができるね。人形がいた場所に同じポーズをした人形のピンを置くとクリアだ！",
			"地図に赤色で描かれたバツ印の場所を観察してみよう。",
			"ー",
			"金色の巻物を広げても何も描かれていない。この巻物には何か仕掛けがあるようだ。そういえばどこかに金色の巻物についての文章があったはず。",
			"ー",
			"鍛冶屋の釜戸には隠し扉があり、地下へとつながっている。地下は迷路になっていて正しい道順があるようだ。道順を知るには巻物に描かれた絵の謎を解く必要があるようだ。",
			"さぁ、あとは出口の鍵を開けて脱出するだけだ！",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint2":[
			"",
			"小さい棚の上には絵が描いてある。絵をよく見ると３つの急須のようにも見えるね。",
			"",
			"絵の黄色部分と同じ場所のタンスの扉を開けてみよう。扉を開けると線が描かれているね。組合せてみると何かわかるかも。",
			"",
			"持っているロウソクに火をつけたら、部屋にある3つのロウソクにも火をつけよう。火をつけるには順番があるみたいだ。",
			"部屋にある和服がボタンと同じ色だね。それぞれの和服の周りを観察すると何かわかるかも。例えば床とか…",
			"白い和服の近くにはボタンが3つあるね。ボタンに描かれた絵は小判の絵柄と同じみたいだ。",
			"",
			"人形は4色あってぐるぐる繰り返しているようだ。4色を表しているものが部屋のどこかにないだろうか。",
			"",
			"扇子には絵と矢印が描かれている。扇子の絵と同同じものが壁に描かれた9つの家紋の中にもあるね。",
			"-",
			"お城の入口には緑色の塀がある。塀の瓦はボタンの絵とよく似ているね。",
			"最初の建物にはテーブルの上に3つの紙がある。紙をめくると図形が描かれているね。",
			"鍛冶屋の中の釜戸に火をつけよう。",
			"橋を渡る手前に旗が立っているね。ボタンのマークは旗に描かれた絵を表しているようだ。旗の絵と同じようにボタンを合わせよう。",
			"",
			"",
			"刀を鍛えるにはまず鍛冶屋の釜戸に刀を入れて加熱しよう。",
			"池の近くには竹がある。竹を刀で切ってみよう。",
			"",
			"扉の鍵は正しい順番にボタンを押す必要があるみたい。順番は巻物の絵が表しているようだ。絵にある斜めの線の数があやしいね。",
			"お城の３階の階段近くには絵がある。この絵が武器を表しているようだ。",
			"鍛冶屋の壁には三日月の形をした武器が３つあるね。",
			"屏風には龍、虎、ツルが描かれている。それぞれの屏風の枚数に注目してみよう。",
			"手裏剣の近くには絵があるね。絵はそれぞれの手裏剣の形を表しているようだ。",
			"",
			"",
			"絵はお城を表しているようだ。お城を外から見ると開けた窓の色がわかるね。",
			"お城の最上階から池の方向の景色が見れる。よく見ると竹は##4##を表しているよ。他にも数字がないだろうか。",
			"",
			"",
			"鍛冶屋にあるタンスの上には円形の板がある。この板は的のようにも見えるね。",
			"池で桶に水を入れることができるよ。",
			"釜戸の中に水をかけると火を消すことができるよ。",
			"右２つのピンの人形は最初の建物の壁と鍛冶屋の中にいるね。",
			"",
			"木の根元には何かを埋めたような跡があるね。どうにかして土を掘ることができないだろうか。",
			"",
			"お城の最上階には金色の巻物についての文章がある。そこには##水と関係している##と書かれているね。",
			"",
			"巻物に描かれた絵は扇子を表しているみたいだ。最初の建物にあった4つの扇子を巻物の絵の通りにしてみよう。",
			"ゴールは目の前だ！いざ脱出だ！",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint3":[
			"",
			"絵は丸を中心に急須の取っ手と注ぎ口を表しているよ。この絵と同じように急須を合わせるとクリアだ！急須の注ぎ口の向きは、右上の急須は##右上##に、左上の急須は##左下##に、下の急須は##左上##の向きだね。",
			"",
			"黄色部分の扉の中にある線を組み合わせると数字になるよ！答えは##493##だ。",
			"",
			"ロウソクに描かれた線の数の順番に火をつけたらクリアだ！",
			"よく見ると和服がある畳はそれぞれ配置が違うよ。それぞれの和服が置いてある畳の形にボタンを合わせるとクリアだ！",
			"ボタンの絵と同じ小判の形に合わせよう。左から##丸の中に四角、楕円形、二重丸##が正解だ！",
			"",
			"白い和服の近くに丸いボタンが4つある。これは人形の色を表しているよ。青色から続くようにオレンジ色、緑色、赤色とすればクリアだ！",
			"",
			"扇子の絵と同じ家紋からスタートして、矢印の通りに家紋をたどってみよう。そうするとボタンの答えは左から##上の段の真ん中の家紋、中央の家紋、上の段の真ん中の家紋、上の段の右の家紋##だ。",
			"",
			"塀の穴の形と同じようにボタンの図形を合わせよう。答えは##長方形、正方形、三角形##だ！",
			"刀のツバの形と同じように紙の図形をそろえよう。左から##八角形、五角形、楕円形##が正解だ！",
			"",
			"",
			"",
			"",
			"刀を加熱して赤くなったら、ハンマーで叩いて刀を鍛えよう。",
			"",
			"",
			"巻物の絵にある斜めの線の数の順番に同じ形のボタンを押そう。答えは##下、真ん中、左、右、上##の順番だ。",
			"絵の線の長さの通りに3種類の武器を並び替えよう。一番長い武器は上から2番目に、二番目に長い武器は1番下に、一番短い武器は真ん中に置くとクリアだ！",
			"三日月の形をした武器と同じように傘の三日月を合わせよう。三日月の位置は左から##左、上、右##だ！",
			"ボタンにある縦線は屏風の枚数を表しているよ。それぞれの枚数の屏風に描かれている動物にボタンを合わせるとクリアだ！答えは##ツル、龍、虎##だね。",
			"絵の通りに手裏剣を置くとクリアだ！",
			"",
			"",
			"ボタンは窓の色を表しているよ。ボタンを上から##赤、青、黄色##にすればクリアだ！",
			"同じ景色では木が##7##を表し、石が##6##を表しているよ。ボタンの答えは##746##だ！",
			"",
			"",
			"板の中にあるボール２つを的に刺さった矢の位置に合わせるとクリアだ！内側のボールは右に、外側のボールは左上の位置だね。",
			"",
			"",
			"左２つのピンの人形はお城の最上階と池の中にいるね。",
			"",
			"手に入れたくわを使うと土を掘ることができるよ。",
			"",
			"池に巻物を沈めてみよう。",
			"",
			"巻物の絵の通りに扇子を合わせると##家紋、左矢印、上矢印、右矢印##になるね。この家紋は地下室の床に描かれている絵と同じだね。つまり、地下室を##左、真っ直ぐ、右##の順番に進めばクリアだ！",
			"最後までプレイいただき、ありがとうございました。本作より脱出後におまけステージを追加いたしました。ぜひそちらも遊んでいただけたら幸いです。これからもあなたに楽しんでもらえる脱出ゲームを作ってまいります。",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint4":[
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		]
	},
	"en":{
		"hint1":[
			"",
			"The teapot on the table will rotate when you tap it. There seems to be a correct direction for each. There must be something somewhere indicating the direction of the teapot.",
			"-",
			"There are three pictures and a button under the teapot. The picture seems to represent a chest of drawers.",
			"-",
			"Let's light the candle we got from the dresser drawer. There must have been a flame somewhere.",
			"There are three buttons on the small shelf. There are three buttons: yellow, red, and white. I wonder if there's something of the same color somewhere in the room.",
			"The drawer of the small shelf is filled with small coins. You must have seen the designs drawn on each small coin somewhere in the room.",
			"-",
			"There is something suspicious on the wall near the white kimono. If you touch it, a doll will come out. If you touch it many times, dolls of various colors will come out.",
			"-",
			"The picture near the white Japanese clothes represents a fan. Let's move the four fans in the room to ##open, close, open, close## from the left as shown in the picture.",
			"Get the key from the drawer of the dresser where the fan is, and try to open the door to the room.",
			"There is a button on the door of the building near the archery range. The green picture above the button seems to be important. I wonder if there's something similar somewhere?",
			"Inside the blacksmith's shop, there are three swords in a basket. If you look closely, you can see that the shapes of the brim are all different.",
			"Once you get the candle from the table in the first building, you'll want to light it somewhere. Let's find a place to light a fire.",
			"When you cross the bridge and go to the exit, there will be a box near the door. Look for the place with the same mark as the button on the box.",
			"-",
			"-",
			"You can get a sword from the box. When I pulled the sword out of its scabbard, the blade was in tatters. I can't cut anything like this... I wonder if I can somehow train my sword.",
			"I've trained my sword, so I want to try cutting something with it. Is there anything that could be cut with a sword somewhere?",
			"-",
			"When you unfold the scroll you got from inside the bamboo, a picture is drawn on it. This picture is similar in shape to the button on the lock of a castle door.",
			"Three types of weapons are displayed inside the castle. Look to see if there's anything that represents where you should place your weapon.",
			"Inside the castle, there is an umbrella with a crescent moon drawn on it. There must have been something the same shape as the crescent moon in other places as well.",
			"On the third floor of the castle, there is a button with an animal drawn on it. Animals are also drawn on the folding screen. First, let's open all the folding screens in the castle.",
			"On the third floor of the castle, there is a place where shuriken are stacked on top of each other. You can also place the three shuriken you've gotten so far.",
			"Use the key to unlock the chain hanging on the stairs.",
			"There are windows on each floor of the castle. Let's open all the windows.",
			"There are three buttons in the dresser drawer in the blacksmith's shop, and behind each button is a picture. The picture looks like a castle.",
			"There are numbered buttons on the chest of drawers on the top floor of the castle. Is there a place where you can see the numbers? For example, the view from the castle...",
			"Let's combine the bows and arrows we got.",
			"Let's shoot an arrow at the target at the archery range.",
			"There are two arrows stuck in the target. It seems that the location of the bite is somehow important.",
			"Let's fill the bucket we got from the chest of drawers with water. Speaking of places with water.",
			"How should I use the water in the bucket? Maybe I can put out the fire.",
			"You can place a pin with a doll on it on the map outside. It seems to be a good idea to place pins with the same pose where each doll is. First, find the four dolls.",
			"You can place a pin with a doll on it on the map outside. Place a pin of a doll in the same pose where the doll was and it will be cleared!",
			"Let's take a look at the locations marked with red crosses on the map.",
			"-",
			"When the golden scroll is unfolded, nothing is drawn on it. This scroll seems to have some kind of trick. There must have been a text about the golden scroll somewhere.",
			"-",
			"There is a hidden door in the cauldron that allows you to go underground. It seems that in order to know the directions underground, it is necessary to solve the riddle drawn on the scroll.",
			"Now, all you have to do is unlock the exit and escape!",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint2":[
			"",
			"There is a picture on the small shelf. If you look closely at the picture, it looks like three teapots.",
			"",
			"Let's open the door in the same place as the yellow part in the picture. When you open the door, you'll see a line drawn on it. Maybe you can figure something out by combining them.",
			"",
			"Light the candle you have, then light the three candles in the room. There seems to be an order to lighting the fire.",
			"The Japanese clothes in the room are the same color as the buttons. If you look around each kimono, you might learn something. For example, the floor...",
			"There are three buttons near the white kimono. The picture drawn on the button seems to be the same as the one on the small size.",
			"",
			"The dolls have 4 colors and seem to repeat over and over again. Is there something somewhere in the room that represents the four colors?",
			"",
			"A picture and an arrow are drawn on the fan. The same picture on the fan is also among the nine family crests painted on the wall.",
			"-",
			"There is a green wall at the entrance to the castle. The tiles on the wall look a lot like the picture on the button.",
			"The first building has three papers on a table. When you turn the paper over, you can see a shape drawn on it.",
			"Let's light the fire in the cauldron inside the blacksmith shop.",
			"There is a flag before you cross the bridge. The mark on the button seems to represent a picture drawn on the flag. Match the buttons in the same way as the flag picture.",
			"",
			"",
			"To forge a sword, first place it in the blacksmith's kettle and heat it.",
			"There is bamboo near the pond. Let's cut bamboo with a sword.",
			"",
			"The picture on the scroll seems to indicate the order in which you press the door lock buttons. The number of diagonal lines in the picture is suspicious.",
			"There is a painting near the stairs on the third floor of the castle. This picture seems to represent a weapon.",
			"There are three crescent moon-shaped weapons on the wall of the blacksmith shop.",
			"Dragons, tigers, and cranes are depicted on the folding screen. Let's take a look at the number of screens on each screen.",
			"There's a picture near the shuriken. The pictures seem to represent the shape of each shuriken.",
			"",
			"",
			"The picture seems to represent a castle. When you look at a castle from the outside, you can see the color of the open windows.",
			"You can see the view towards the pond from the top floor of the castle. If you look closely, the bamboo represents the number ##4##. Are there any other numbers?",
			"",
			"",
			"There is a circular board on top of the chest of drawers in the blacksmith shop. This board looks like a target.",
			"You can fill the bucket with water at the pond.",
			"You can put out the fire by pouring water into the pot.",
			"The two pin figures on the right are on the wall of the first building and inside the blacksmith shop.",
			"",
			"There are traces of something buried at the base of the tree. Is there any way I can dig up the soil?",
			"",
			"On the top floor of the castle there is a text about a golden scroll. It says ##related to water##.",
			"",
			"The picture on the scroll seems to represent a fan. Let's make the four fans in the first building look like the pictures on the scroll.",
			"The goal is in front of you! It's time to escape!",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint3":[
			"",
			"The picture depicts the handle and spout of a teapot with a circle in the center. If you match the teapot like this picture, it will be clear! The spouts of teapots are oriented to the top right for the top right teapot, the bottom left for the top left teapot, and the top left for the bottom teapot.",
			"",
			"Combine the lines inside the yellow door to make numbers! The answer is ##493##.",
			"",
			"If you light the candles in the order of the number of lines drawn on them, the game is cleared!",
			"If you look closely, you can see that the tatami mats with Japanese clothes are arranged differently. Match the button to the shape of the tatami mat where each Japanese clothing is placed to clear the screen!",
			"Match it to the same oval shape as the button picture. From the left, the correct answer is ##square inside a circle, oval, double circle##!",
			"",
			"There are four round buttons near the white kimono. This represents the doll's color. If you follow the blue color with orange, green, and red, it's clear!",
			"",
			"Start with the same family crest as the picture on the fan and follow the arrow. Then, from the left, the button answers are ##family crest in the middle of the upper row, family crest in the middle, family crest in the middle of the upper row, family crest on the right of the upper row.##",
			"",
			"Match the shape of the button to match the shape of the hole in the fence. The answer is ##rectangle, square, triangle##!",
			"Align the paper shapes to match the shape of the sword's brim. From the left, ##octagon, pentagon, oval## is the correct answer!",
			"",
			"",
			"",
			"",
			"Heat the sword until it turns red, then hit it with a hammer to forge the sword.",
			"",
			"",
			"Press the buttons of the same shape in the order of the number of diagonal lines on the picture on the scroll. The answer is ##bottom, middle, left, right, top##.",
			"Arrange the three types of weapons according to the length of the line in the picture. Place the longest weapon second from the top, the second longest weapon at the bottom, and the shortest weapon in the middle to clear!",
			"Match the crescent moon on the umbrella in the same way as the crescent moon shaped weapon. The position of the crescent moon is ##left, top, right## from left to right!",
			"The vertical line on the button represents the number of folding screens. Match the buttons with the animals drawn on each number of folding screens to clear the game! The answer is ##cranes, dragons, and tigers.##",
			"Place the shuriken as shown in the picture to clear the game!",
			"",
			"",
			"The buttons represent the color of the window. Clear the game by changing the buttons from the top to ##red, blue, yellow##!",
			"In the same scenery, the tree represents ##7## and the stone represents ##6##. The button's answer is ##746##!",
			"",
			"",
			"Align the two balls on the board with the arrows that hit the target to clear the game! The inner ball is on the right, and the outer ball is on the upper left.",
			"",
			"",
			"The two pin dolls on the left are on the top floor of the castle and in the pond.",
			"",
			"You can use the hoe you get to dig in the soil.",
			"",
			"Let's sink the scroll into the pond.",
			"",
			"If you align the fan according to the picture on the scroll, it will become a family crest, left arrow, up arrow, right arrow. This family crest is the same as the picture painted on the basement floor. In other words, if you go through the basement in the order of ##left, straight, right## you will clear it!",
			"Thank you for playing until the end. From this work, we have added a bonus stage after escaping. I would appreciate it if you could play it as well. We will continue to create escape games that you can enjoy.",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint4":[
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		]
	},
	"zh_CN":{
		"hint1":[
			"",
			"桌子上有三个茶壶。点击茶壶时，茶壶会旋转。每个人似乎都有一个正确的方向。一定有什么东西指示茶壶的方向。",
			"-",
			"茶壶下面有三张图片和一个按钮。这幅画似乎代表了一个抽屉柜。",
			"-",
			"让我们点燃从梳妆台抽屉里拿出的蜡烛。一定是某个地方有火焰。",
			"小架子上有三个按钮。共有三个按钮：黄色、红色和白色。我想知道房间里是否有相同颜色的东西。",
			"小架子的抽屉里装满了小硬币。您一定在房间的某个地方看到过每枚小硬币上绘制的图案。",
			"-",
			"白色和服附近的墙上有一些可疑的东西。如果你触摸它，就会出来一个娃娃。多碰几次就会出来各种颜色的娃娃。",
			"-",
			"白色日服附近的图片代表一把扇子。我们把房间里的四个风扇从左边开始“开、关、开、关”，如图所示。",
			"从风扇所在的梳妆台抽屉里拿到钥匙，尝试打开房间的门。",
			"射箭场附近大楼的门上有三个按钮。按钮上方的绿色图片似乎很重要。我想知道有没有类似的地方？",
			"铁匠铺内，篮子里放着三把剑。如果仔细观察，可以发现帽檐的形状各不相同。",
			"一旦你从第一栋楼的桌子上拿到蜡烛，你就会想在某个地方点燃它。我们找个地方生火吧。",
			"当你过桥并走到出口时，门附近会有一个盒子。看起来盒子上有按钮，你需要匹配标记。让我们寻找具有相同标记的地方。",
			"-",
			"-",
			"你可以从出口附近的盒子里得到一把剑。当我把剑从剑鞘中拔出来时，剑刃已经破烂不堪。我不能砍这样的东西……我想知道我是否可以以某种方式训练我的剑。",
			"我已经练好了我的剑，所以我想尝试用它来砍东西。哪里有可以用剑砍断的东西吗？",
			"-",
			"当你展开从竹子里得到的卷轴时，上面就会画出一幅图画。这张图片的形状类似于城堡门锁上的按钮。",
			"城堡的二楼展示着三种武器。看来我需要将武器重新排列到正确的位置。在某处寻找显示武器顺序的东西。",
			"城堡二楼有三把伞。伞上画着一弯新月。其他地方肯定也有类似新月形状的东西。",
			"城堡的三楼有一个按钮，上面画着一只动物。我确信屏风上也画有动物。首先我们把城堡内的屏风全部打开。",
			"城堡的第三层，有一个地方，手里剑堆叠在一起。您还可以放置目前为止获得的三把手里剑。似乎有一个正确的手里剑放置方法。",
			"使用钥匙打开挂在楼梯上的链条。",
			"城堡的每一层都有窗户。让我们打开所有的窗户。",
			"铁匠铺的梳妆台抽屉里有三个纽扣，每个纽扣后面都有一张图片。图片看起来像一座城堡。",
			"城堡顶层的抽屉柜上有三个编号的按钮。有没有地方可以看到数字？例如，从城堡看到的景色......",
			"让我们把我们得到的弓和箭组合起来。",
			"让我们向射箭场的靶子射箭吧。",
			"有两支箭卡在目标上。看来咬伤的位置有些重要。",
			"我们把从抽屉柜里拿出来的水桶装满水吧。说到有水的地方。",
			"桶里的水应该怎么用？也许我能把火扑灭。",
			"您可以在外面的地图上放置一个带有娃娃的图钉。在每个娃娃所在的位置放置具有相同姿势的别针似乎是个好主意。首先，找到四个娃娃。",
			"您可以在外面的地图上放置一个带有娃娃的图钉。将一个娃娃的别针放在与娃娃相同的姿势上，它就会被清除！",
			"我们来看看地图上标有红叉的位置。",
			"-",
			"当金色卷轴展开时，上面什么也没有绘制。这卷轴似乎有什么诡计。想来，应该有一篇关于黄金卷轴的文章吧。",
			"-",
			"铁匠的水壶里有一扇隐藏的门通向地下室。地下室是一个迷宫，似乎有一条正确的道路。看来，要想找到方向，就必须解开卷轴上所描绘的图画之谜。",
			"现在，你所要做的就是解锁出口并逃脱！",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint2":[
			"",
			"小架子上有一张照片。如果仔细看图片，它看起来像三个茶壶。",
			"",
			"我们打开图中黄色部分所在位置的梳妆台门。当你打开门时，你会看到上面画着一条线。也许你可以通过将它们结合起来找出一些东西。",
			"",
			"点燃你手上的蜡烛，然后点燃房间里的三支蜡烛。似乎有点火的命令。",
			"房间里的日服和纽扣的颜色是一样的。如果你仔细观察每件和服，你可能会学到一些东西。例如，地板...",
			"白色和服附近有三颗纽扣。按钮上绘制的图片似乎与小尺寸上的图片相同。",
			"",
			"娃娃有 4 种颜色，似乎一遍又一遍地重复。房间里有什么东西代表四种颜色吗？",
			"",
			"扇子上画有图画和箭头。墙上绘有九个家徽，扇子上也有同样的图案。",
			"-",
			"城堡入口处有一堵绿色的墙。墙上的瓷砖看起来很像按钮上的图片。",
			"第一栋楼的桌子上放着三张纸。当你把纸翻过来时，你可以看到上面画着一个形状。",
			"让我们点燃铁匠铺内的大锅里的火。",
			"过桥之前有一面旗帜。按钮上的标记似乎代表了旗帜上绘制的图画。按照与旗帜图片相同的方式匹配按钮。",
			"",
			"",
			"要锻造剑，首先将其放入铁匠的水壶中并加热。",
			"池塘边有竹子。我们用剑砍竹子吧。",
			"",
			"看来你需要按正确的顺序按下按钮才能锁门。卷轴上的图片似乎表明了顺序。图中的对角线数量可疑。",
			"城堡三楼楼梯附近有一幅画。这张图片似乎代表着一件武器。",
			"铁匠铺的墙上挂着三把月牙形的兵器。",
			"屏风上绘有龙、虎、鹤等图案。我们来看看每个屏幕上的屏幕数量。",
			"手里剑附近有一张照片。这些图片似乎代表了每个手里剑的形状。",
			"",
			"",
			"这幅画似乎代表一座城堡。当你从外面看城堡时，你可以看到打开的窗户的颜色。",
			"从城堡的顶楼可以看到池塘的景色。仔细一看，竹子代表数字“4”。还有其他数字吗？",
			"",
			"",
			"铁匠铺的抽屉柜顶上有一块圆板。这块板看起来像一个目标。",
			"您可以在池塘边将桶装满水。",
			"将水倒入锅中即可将火扑灭。",
			"右侧的两个图钉人物位于第一栋建筑的墙壁上和铁匠铺内。",
			"",
			"树根处有埋藏过什么东西的痕迹。有什么办法可以把土挖出来吗？",
			"",
			"城堡的顶层有一段关于金色卷轴的文字。它说“与水有关”。",
			"",
			"卷轴上的图案似乎代表着一把扇子。让我们把第一栋楼里的四把扇子做成画卷上的样子。",
			"目标就在你的面前！是时候逃跑了！",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint3":[
			"",
			"图中描绘了茶壶的把手和壶嘴，中心有一个圆圈。如果像这图这样搭配茶壶，那就一目了然了！右上茶壶的茶壶壶嘴朝右上，左上茶壶的壶嘴朝左下，下茶壶的壶嘴朝左上。",
			"",
			"将黄色门内的线条组合起来组成数字！答案是“493”。",
			"",
			"如果您按照蜡烛上绘制的线数顺序点燃蜡烛，游戏就通关了！",
			"仔细观察，可以发现和服的榻榻米排列方式有所不同。将按钮与放置每件日式服装的榻榻米形状相匹配即可清除屏幕！",
			"将其与按钮图片相同的椭圆形相匹配。从左往右看，正确答案是“圆内方、椭圆形、双圆”！",
			"",
			"白色和服附近有四个圆形纽扣。这代表娃娃的颜色。如果你按照蓝色搭配橙色、绿色和红色，那就很清楚了！",
			"",
			"从与扇子上的图片相同的家族徽章开始，然后沿着箭头走。然后，从左开始，按钮答案是“上排中间的家族徽章，中间的家族徽章，上排中间的家族徽章，上排右侧的家族徽章”。",
			"",
			"将按钮的形状与栅栏上的孔的形状相匹配。答案是“长方形、正方形、三角形”！",
			"对齐纸张形状以匹配剑边缘的形状。从左边开始，“八边形、五边形、椭圆形”就是正确答案！",
			"",
			"",
			"",
			"",
			"将剑加热至红色，然后用锤子敲击，即可锻造剑。",
			"",
			"",
			"按照卷轴图片上对角线的数量顺序按下相同形状的按钮。答案是“下、中、左、右、上”。",
			"根据图中线条的长度排列三种武器。把最长的武器放在从上往下数第二个，第二长的武器放在底部，最短的武器放在中间来清除！",
			"以与月牙形武器相同的方式搭配伞上的月牙。新月的位置从左到右是“左、上、右”！",
			"按钮上的竖线代表折叠屏的数量。将按钮与每个折叠屏幕上绘制的动物相匹配即可通关游戏！答案是“鹤、龙、虎”。",
			"如图所示放置手里剑即可通关！",
			"",
			"",
			"按钮代表窗口的颜色。将顶部的按钮更改为“红、蓝、黄”即可通关游戏！",
			"在同一风景中，树代表“7”，石头代表“6”。按钮的答案是“746”！",
			"",
			"",
			"将棋盘上的两个球与击中目标的箭头对齐即可通关游戏！内球在右侧，外球在左上方。",
			"",
			"",
			"左边的两个别针娃娃位于城堡的顶层和池塘里。",
			"",
			"您可以使用获得的锄头来挖掘土壤。",
			"",
			"让我们把卷轴沉入池塘吧。",
			"",
			"如果你按照卷轴上的图片对齐扇子，它就会变成家徽、左箭头、上箭头、右箭头。这个家徽和地下室地板上画的图是一样的。换句话说，如果你按照“左、直、右”的顺序穿过地下室，你就能通关！",
			"感谢您一直玩到最后。在本作中，我们增加了逃脱后的奖励阶段。如果你也能玩的话我将不胜感激。我们将继续创造您可以享受的逃脱游戏。",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint4":[
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		]
	},
	"ko":{
		"hint1":[
			"",
			"테이블에는 급수가 3개 있다. 급수는 탭하면 회전합니다. 각각 올바른 방향이 있는 것 같다. 어딘가에 급수의 방향을 나타내고 있는 것이 있을 것이다.",
			"-",
			"급수 아래에는 3개의 그림과 버튼이 있다. 그림은 탄스를 나타내는 것 같다.",
			"-",
			"옷장 서랍에서 얻은 촛불에 불을 붙여 보자. 불꽃이 어딘가에 있었을 것입니다.",
			"작은 선반에는 버튼이 3개 있다. 버튼은 노란색, 빨강, 흰색의 3개군요. 이것과 같은 색의 것이 방의 어딘가에도 없을까.",
			"작은 선반의 서랍에는 소판이 가득 들어 있다. 각각의 소판에 그려진 도안은 방의 어딘가에서도 본 것.",
			"-",
			"하얀 일본옷 근처의 벽에는 끔찍한 곳이. 만져 보면 인형이 나올거야. 여러 번 만지면 여러 가지 색의 인형이 나온다.",
			"ー",
			"하얀 일본옷 근처에 있는 그림은 부채를 나타내고 있어. 방에 있는 4개의 부채를 그림처럼 왼쪽에서 ##열기, 닫기, 열기, 닫기##로 해보자.",
			"부채가 있는 탕스의 서랍에서 열쇠를 얻으면, 방의 문을 열어 보자.",
			"궁도장 근처 건물 문에는 버튼이 3개 있다. 버튼 위에 있는 녹색 그림이 중요해 보인다. 비슷한 것이 어딘가에 없을까.",
			"대장장이 안에는 바구니 안에 3개의 칼이 들어 있다. 잘 보면 동백나무의 모양이 전부 다르네요.",
			"첫 번째 건물의 테이블에서 촛불을 얻으면 어딘가에 불을 붙이고 싶다. 불을 붙이는 장소를 찾아 보자.",
			"다리를 건너 출구까지 가면 문 근처에 상자가 있네요. 상자에는 버튼이 있어 마크를 맞추어야 한다. 같은 마크가 그려진 장소를 찾아 보자.",
			"ー",
			"ー",
			"출구 근처의 상자에서 칼을 얻을 수 있어요. 칼집에서 검을 빼면 칼날은 엉망이다. 이대로는 아무것도 끊을 수 없다… 어떻게든 칼을 단련할 수 없는 것일까.",
			"칼을 단련했기 때문에 시험에 무언가를 자르고 싶다. 어딘가에 칼로 끊어질 것 같은 것이 없을까.",
			"ー",
			"대나무 속에서 얻은 두루마리를 펼치면 그림이 그려져 있다. 이 그림은 성의 문 열쇠에 있는 버튼과 모양이 비슷하네요.",
			"성의 2층에는 3종류의 무기가 장식되어 있다. 무기를 올바른 위치로 정렬할 필요가 있는 것 같다. 무기의 순서를 나타내는 것이 어딘가에 있는지 찾아 보자.",
			"성 2층에는 우산이 3개 있다. 우산에는 초승달이 그려져 있다. 초승달과 같은 형태의 것이 다른 장소이었을 것.",
			"성 3층에는 동물이 그려진 버튼이 있다. 확실히 병풍에도 동물이 그려져 있었을 것이다. 우선 성에 있는 병풍을 전부 열어보자.",
			"성의 3층에는 수리검이 겹치는 곳이 있다. 지금까지 얻은 3개의 수리검도 둘 수 있어요. 수리검에는 올바른 두는 방법이 있는 것 같다.",
			"열쇠를 사용하여 계단에 걸린 체인의 열쇠를 열자.",
			"성의 각 층에는 창문이 있습니다. 창문을 모두 열어 보자.",
			"대장장이에 있는 탄스의 서랍에는 버튼이 3개 있고, 버튼 뒤에는 그림이 있다. 그림은 성처럼 보이네요.",
			"성의 최상층에 있는 탄스에는 숫자 버튼이 3개 있다. 어딘가에 숫자가 보이는 곳이 없을까. 예를 들어 성에서 내려다 보는 경치에 ...",
			"손에 넣은 활과 화살을 조합해 보자.",
			"궁도장을 향해 화살을 내보자.",
			"적으로는 화살이 2개 찔리고 있다. 박힌 위치가 뭔가 중요한 것 같다.",
			"옷장에서 얻은 통에 물을 넣어 보자. 물이 있는 장소라고 하면.",
			"통에 들어간 물은 어떻게 쓰자. 불을 끄거나 할 수 있을지도.",
			"밖에 있는 지도에는 인형이 그려진 핀을 둘 수 있어요. 각각의 인형이 있는 곳에 같은 포즈의 핀을 두면 좋다. 우선 4개의 인형을 찾아보자.",
			"밖에 있는 지도에는 인형이 그려진 핀을 둘 수 있어요. 인형이 있던 장소에 같은 포즈를 한 인형의 핀을 두면 클리어다!",
			"지도에 붉은 색으로 그려진 발표의 위치를 ​​관찰해 보자.",
			"ー",
			"금빛 두루마리를 펼쳐도 아무것도 그려지지 않았다. 이 두루마리에는 뭔가 장치가 있는 것 같다. 그러고 보면 어딘가에 금색의 두루마리에 대한 문장이 있었을 것이다.",
			"ー",
			"대장장이의 가마도에는 숨겨진 문이 있어 지하로 연결되어 있다. 지하는 미로가 되어 있어 올바른 길순이 있는 것 같다. 길순을 알기 위해서는 두루마리에 그려진 그림의 수수께끼를 풀 필요가 있는 것 같다.",
			"자, 나머지는 출구 열쇠를 열고 탈출할 뿐이다!",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint2":[
			"",
			"작은 선반 위에는 그림이 그려져 있다. 그림을 잘 보면 3개의 급수처럼 보이네요.",
			"",
			"그림의 노란색 부분과 같은 장소의 옷장 문을 열어 보자. 문을 열면 선이 그려져 있네요. 조합해 보면 뭔가 알지도.",
			"",
			"가지고 있는 촛불에 불을 붙이면 방에 있는 3개의 촛불에도 불을 붙이자. 불을 붙이려면 순서가 있는 것 같다.",
			"방에 있는 일본옷이 버튼과 같은 색이군요. 각각의 일본 옷 주위를 관찰하면 무엇인지 알지도. 예를 들어 바닥 등 ...",
			"하얀 일본옷 근처에는 버튼이 3개 있네요. 버튼에 그려진 그림은 소판의 도안과 같다.",
			"",
			"인형은 4색 있어 빙글빙글 반복하고 있는 것 같다. 4색을 나타내고 있는 것이 방의 어딘가에 없을까.",
			"",
			"부채에는 그림과 화살표가 그려져 있다. 부채의 그림과 같은 것이 벽에 그려진 9개의 가문 안에도 있네요.",
			"-",
			"성 입구에는 녹색 담이 있습니다. 담의 기와는 버튼의 그림과 매우 비슷하다.",
			"최초의 건물에는 테이블 위에 3개의 종이가 있다. 종이를 넘기면 도형이 그려져 있네요.",
			"대장장이 안의 가마도에 불을 붙이자.",
			"다리를 건너기 전에 깃발이 서 있습니다. 버튼의 마크는 깃발에 그려진 그림을 나타내는 것 같다. 깃발 그림처럼 버튼을 맞추자.",
			"",
			"",
			"칼을 단련하려면 우선 대장장이의 가마도에 칼을 넣고 가열하자.",
			"연못 근처에는 대나무가 있다. 대나무를 검으로 자르자.",
			"",
			"문 열쇠는 올바른 순서로 버튼을 누를 필요가 있는 것 같다. 차례는 두루마리의 그림이 나타내는 것 같다. 그림에 있는 대각선의 수가 좋지 않다.",
			"성의 3층 계단 근처에는 그림이 있다. 이 그림이 무기를 나타내는 것 같다.",
			"대장장이의 벽에는 초승달 모양의 무기가 3개 있네요.",
			"병풍에는 용, 호랑이, 덩굴이 그려져 있다. 각각의 병풍의 매수에 주목해 보자.",
			"수리검 근처에는 그림이 있네요. 그림은 각각의 수리검의 형태를 나타내는 것 같다.",
			"",
			"",
			"그림은 성을 나타내는 것 같다. 성을 밖에서 보면 열린 창문의 색을 알 수 있습니다.",
			"성의 최상층에서 연못 방향의 경치를 볼 수 있다. 잘 보면 대나무는 ##4##를 나타내고 있어. 그 밖에도 숫자가 없을까.",
			"",
			"",
			"대장장이에 있는 탄스 위에는 원형 판이 있다. 이 판은 적처럼 보이네요.",
			"연못에서 통에 물을 넣을 수 있어.",
			"부문 안에 물을 뿌리면 불을 끌 수 있어.",
			"오른쪽 2개의 핀의 인형은 최초의 건물의 벽과 대장장이 안에 있다.",
			"",
			"나무의 뿌리에는 뭔가를 묻은 흔적이 있네요. 어떻게 해서 흙을 파지 못할까.",
			"",
			"성의 최상층에는 금색의 두루마리에 대한 문장이 있다. 거기에는 ##물과 관련되어있다##라고 쓰여져 있군요.",
			"",
			"두루마리에 그려진 그림은 부채를 나타내는 것 같다. 최초의 건물에 있던 4개의 부채를 두루마리의 그림대로 해 보자.",
			"목표는 눈앞이다! 막상 탈출이다!",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint3":[
			"",
			"그림은 원을 중심으로 급수의 손잡이와 주둥이를 나타내고 있어. 이 그림과 같이 급수를 맞추면 클리어다! 급수의 주둥이의 방향은, 오른쪽 위의 급수는 ##오른쪽 상단##에, 좌상의 급수는 ##좌하##에, 아래의 급수는 ##좌상##의 방향이군요.",
			"",
			"노란색 부분의 문 안에있는 선을 조합하면 숫자가 될거야! 대답은 ##493##이다.",
			"",
			"촛불에 그려진 선의 수의 순서에 불을 붙이면 클리어다!",
			"잘 보면 일본옷이 있는 다다미는 각각 배치가 다르다. 각각의 일본옷이 놓여 있는 다다미의 형태에 버튼을 맞추면 클리어다!",
			"버튼의 그림과 같은 소형 모양에 맞추자. 왼쪽에서 ##환 안에 사각형, 타원형, 이중 원##이 정답이다!",
			"",
			"하얀 일본옷 근처에 둥근 버튼이 4개 있다. 이것은 인형의 색을 나타냅니다. 청색에서 계속되도록 오렌지색, 녹색, 적색으로 하면 클리어다!",
			"",
			"부채의 그림과 같은 가문에서 시작하여 화살표대로 가문을 따라 보자. 그렇게 하면 버튼의 대답은 왼쪽에서 ##위의 단 중간 가문, 중앙 가문, 위 단 중간 가문, 위 단 오른쪽 가문##이다.",
			"",
			"담의 구멍 모양처럼 버튼 모양을 맞추자. 대답은 ##사각형, 사각형, 삼각형##입니다!",
			"칼의 동백 모양처럼 종이 모양을 갖추자. 왼쪽에서 ##팔각형, 오각형, 타원형##이 정답이다!",
			"",
			"",
			"",
			"",
			"칼을 가열하고 붉게 되면 망치로 두드려 칼을 단련하자.",
			"",
			"",
			"두루마리의 그림에 있는 대각선의 수의 순서에 같은 형태의 버튼을 누르자. 대답은 ##아래, 중간, 왼쪽, 오른쪽, 위##의 순서이다.",
			"그림 선의 길이대로 3종류의 무기를 재배치하자. 가장 긴 무기는 위에서 두 번째로, 두 번째로 긴 무기는 1번 아래로, 가장 짧은 무기는 중간에 두면 클리어다!",
			"초승달 모양의 무기처럼 우산 초승달을 맞추자. 초승달의 위치는 왼쪽에서 ##왼쪽, 위, 오른쪽##이다!",
			"버튼에 있는 세로선은 병풍의 매수를 나타내고 있어. 각각의 매수의 병풍에 그려져 있는 동물에 버튼을 맞추면 클리어다! 대답은 ##덩굴, 용, 호랑이##군요.",
			"그림대로 수리검을 두면 클리어다!",
			"",
			"",
			"버튼은 창의 색을 나타냅니다. 버튼을 위에서 ##빨강, 파랑, 황색##으로 하면 클리어다!",
			"같은 경치에서는 나무가 ##7##을 나타내고, 돌이 ##6##을 나타내고 있어. 버튼의 대답은 ##746##이다!",
			"",
			"",
			"판 안에 있는 볼 2개를 적으로 꽂은 화살의 위치에 맞추면 클리어다! 안쪽의 볼은 오른쪽에, 외부의 볼은 왼쪽 위의 위치군요.",
			"",
			"",
			"왼쪽 2개의 핀의 인형은 성의 최상층과 연못 안에 있다.",
			"",
			"손에 넣은 쿠와를 사용하면 흙을 파낼 수 있어요.",
			"",
			"연못에 두루마리를 가라앉히자.",
			"",
			"두루마리의 그림대로 부채를 맞추면 ##가문, 왼쪽 화살표, 위 화살표, 오른쪽 화살표##가 되네요. 이 가문은 지하실의 바닥에 그려져 있는 그림과 같네요. 즉, 지하실을 ##왼쪽, 똑바로, 오른쪽##의 차례로 진행하면 클리어다!",
			"끝까지 플레이 해 주셔서 감사합니다. 본작보다 탈출 후 덤 무대를 추가했습니다. 꼭 그쪽도 놀아 주시면 다행입니다. 앞으로도 당신에게 즐길 수있는 탈출 게임을 만들어 갈 것입니다.",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint4":[
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		]
	}
}
