{
	"ja":{
		"hint1":[
			"",
			"-",
			"ノートと消しゴムがある机には、8つのボタンがある。ボタンと同じ形のものが教室のどこかにあるみたいだ。",
			"-",
			"三角定規は何に使おう。この定規は３つの角が全部違う形をしているね。どこかに角を表しているマークがないだろうか。",
			"ロッカーにはランドセルがある。ランドセルを正しい場所に置く必要があるみたいだ。ランドセルを動かしてみると何かわかるかも。",
			"ゲットした筆は何に使おう。筆でやることといえば・・・",
			"剥がれた紙の裏にはボタンが3つある。どれも赤と白のマークが描かれている。赤と白のものが教室のどこかにもあったはず。",
			"世界地図のパズルが置いてある机があるね。パズルを完成させればいいみたいだ。",
			"ロッカーの上には3つのボタンと赤青緑のキューブがある。同じ色のキューブが教室のどこかにもあるはずだ。",
			"砂時計はそれぞれ砂が落ちる時間が違うようだね。時間といえばどこかで##時間##という文字を見た気がする。",
			"-",
			"チョークを使って黒板に何か書いてみよう。",
			"黒板の近くの机には数字のボタンがある。数字の画面には黒板に描いた線と同じ色の線があるみたいだね。",
			"黒、青、赤のボタンの左側には棒のようなものもある。この形と同じものが教室のどこかにもあったはず。",
			"鍵を使えるところを探してみよう。例えば、どこかの扉とか・・・",
			"靴箱の近くには朝顔があるよ。よく見ると4色の花が咲いているね。",
			"トイレットペーパーを使う場所といえば・・・",
			"ゲットした掃除ブラシで掃除してみよう。どこかに汚れているところがないかな。",
			"トイレの床にある足跡と同じ靴がどこかにないだろうか。",
			"鍵を使えるところを探そう。階段あたりが怪しいぞ。",
			"朝顔の上にはボタンが4つある。ボタンは2階のある場所を表しているみたいだ。",
			"1階の教室前の廊下には袋が壁にかかっている。袋をよく見ると丸いマークが描かれているね。このマークどこかでも見たような。",
			"ゴミ箱の裏にある絵は水を表しているのかな。水がある場所がどこかにあるはずだ。",
			"押しピンは紙を貼るのに使ってみよう。",
			"マス目のアイテムは紐がついていてどこかにかけられそうだ。かけれる場所が2階のどこかにあるはず。",
			"２階の廊下には同じ２つの絵があるね。絵を見比べると違うところがあるようだ。",
			"扉近くの机には青、赤、黄色の顔があるね。眉毛と口が動くみたい。似たようなものが教室のどこかにもあるはず。",
			"-",
			"-",
			"コンパスを使ってどこかに円を描こう。青色のアルファベットがいっぱいある机には円があるね。5cmと9cmも書かれているけど・・・",
			"教室にはそろばんがあるね。３ヶ所だけ動くようだ。そろばんを表している絵がどこかにないだろうか。例えばどこかのノートに。",
			"-",
			"魚にエサをあげてみよう。そうすると魚が喜んで何かを教えてくれるかも。",
			"窓近くの壁にはボタンが４つある。ランドセルとやリコーダーの絵もあるね。絵と同じものが教室にもあるようだ。",
			"##おもさ##と描かれた机にはゲットした動物を置くことができるね。おもい順番に並べる必要があるみたいだ。どこかにおもさを表しているところがないだろうか。",
			"机の引き出しにはボタンが３つある。それぞれ何かで指し示しているようだ。絵と同じものを見つけよう。",
			"黒板消しですることといえば。",
			"物を動かしてXの形を作ってみよう。１つは2階のトイレが怪しいね。",
			"あとは靴箱近くの扉を開けて脱出するだけ！",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint2":[
			"",
			"",
			"カーテンをタップすると開けるよ。",
			"",
			"数字がいっぱい書かれた机には、角を表すマークが３つある。ここに三角定規を置くと何かわかるかも。",
			"ロッカーの奥には文字が書いてあるようだ。文字が分かればランドセルの置く場所がわかるはずだ。",
			"習字ができる机を探そう。そこで筆に墨汁をつけて、文字を書いてみよう。",
			"教室には組体操をしている人形があるようだ。人形は赤と白の帽子を被っているね。",
			"世界地図がわからない人はネットで調べてみよう。",
			"ロッカーにはキューブが積まれているところがあるね。それぞれの色のキューブの数が答えのようだ。キューブが乗っている土台は回転するよ。",
			"##時間##と書いてある机を見つけよう。そこにはボタンが３つある。時間が長い順番にボタンの色を合わせるといいみたいだ。",
			"-",
			"ピンクと黄色のチョークを使うと黒板に線が描かれるはずだ。この線は角度を表しているようにも見える。角度といえば・・・",
			"置いた分度器をよく見ると、それぞれの線の角度がわかるよ。",
			"教室の後ろ側にはこいのぼりの絵があるよ。",
			"鍵は教室の後ろの扉で使えるよ。",
			"花はそれぞれ大きさも違うようだ。",
			"トイレにはトイレットペーパーがないところがあるよ。そこにセットしてあげよう。",
			"トイレの床は黒く汚れているね。掃除ブラシを使って掃除しよう！",
			"靴箱に足跡と同じ3つの靴があるようだ。靴を正しい順番でタップしないといけないようだね。",
			"鍵で階段にある南京錠を解錠できるよ。",
			"ボタンは2階のトイレ全体を表しているようだ。トイレのボタンの位置にあるものに注目してみよう。",
			"丸いマークは音符の丸い部分にも見えるね。音楽の本が教室のどこかにあったはず。",
			"２階には水道があるね。蛇口が4つあって水を出す順番があるようだ。",
			"2階の廊下にある剥がれかけの紙を押しピンで貼ってあげよう。",
			"2階の廊下の絵にアイテムをかけてみよう。",
			"違うところは3つあるみたいだ。１つは左側の気球だね。",
			"窓の近くには鬼がいるね。鬼の表情と同じように顔を合わせるとクリアだ！",
			"-",
			"-",
			"黒板近くの机には5cmと9cmの定規があるね。ここでコンパスをそれぞれの大きさに開くことができるよ。あとはアルファベットがある机に円を描くだけ。",
			"窓近くの机にはノートがある。ノートにはオレンジ色のマークが描かれているようだ。",
			"",
			"３匹の魚は動いて何かを表しているようだ。数字にも見えるね。",
			"絵と同じ物が置いてある机に注目してみよう。",
			"黒板近くの壁には動物がシーソーに乗っている絵があるね。一番重たいのは牛のようだね。",
			"一番左の赤いマークは包囲磁石を表している。つまり一番左は##E##だ！他の２つも探してみよう。2階で見つからない時は1階も探してみよう。",
			"黒板消しを使って黒板の落書きを消してみよう。",
			"１階の教室にもXを作れる物があるみたいだ。",
			"さぁ　クリアはもうすぐだ！",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint3":[
			"",
			"",
			"ボタンは窓の形を表している。窓が開いているところを白にすればOK。",
			"",
			"三角定規を置くと定規の中に数字が入るね。この数字にボタンを合わせよう。答えは##253##だね。",
			"文字はREDとBLUEを表している。つまり、REDの文字がある場所に赤のランドセルを、BLUEの文字がある場所に青のランドセルを置くとクリアだ！",
			"",
			"ボタンは人形の帽子の色を表しているよ。人形の帽子と同じ色になるようにボタンを合わせればクリアだ。",
			"",
			"キューブの数を数えると青が5個、赤が3個、緑が4個。答えは##534##だ！",
			"砂時計の砂が落ちる時間より、ボタンは左からピンク、黄色、オレンジ色にするとクリアだ！",
			"-",
			"描いた線のところに分度器を置くとOK！",
			"それぞれの線の角度を数字のボタンで入力しよう。黄色は50度、ピンクは140度だから答えは##50140##だ！",
			"ボタンはこいのぼりの数を表しているよ。それぞれの色の数を数えると答えは上から「324」だ！",
			"",
			"教室の掃除箱にある花のボタンは朝顔の大きさを表しているよ。小さい順番に「紫、ピンク、黄色、白」が答えだ！",
			"",
			"",
			"足跡の手前から奥の順番に同じ形の靴をタップしていくとクリアだ！",
			"",
			"ボタンはトイレットペーパーの形を表しているよ。左上が三角、左下が四角、右上は無し、右下は三角だ！",
			"音楽の本の音符の位置と同じように袋の高さを合わせよう。５本の線が目印だね。左から3番目の線、4番目の線、2番目の線、5番目の線でクリアだ！",
			"絵に描かれている数字の順番に蛇口をタップするとOK！",
			"",
			"",
			"残り2つは右側の鳥と、下側の紅葉だね。絵の近くの扉には同じマス目のボタンがあるよ。絵の間違いがある３つの場所をボタンで押すとクリアだ！",
			"",
			"-",
			"-",
			"円を2つ描いたら線が重なる場所があるはずだ。ボタンが表している重なり部分のアルファベットを探そう。答えは##UFO##だ！",
			"ノートのマークと同じようにそろばんを合わせるとクリアだ。",
			"",
			"魚は##917##を表しているようだ！ロッカーにある箱のダイアルを合わせるとクリアだ！",
			"ボタンは物が置いてある机の形を表しているよ。机の形にボタンを合わせればOK！",
			"シーソーの絵からクマ、クジラ、牛の順番に重たいことがわかるよ。この順番で机に置くとクリアだ！",
			"真ん中のボタンは1階の教室にある世界地図を表しているよ。一番右のボタンは２階の教室のノートとペンだね。答えは##EAT##だ！",
			"",
			"トイレのブラシ、教室の掃除箱、靴箱近くの傘でXを3つ作れるね。",
			"最後までプレイしていただきありがとうございました。子供の頃の懐かしい気持ちになりながら本作品を作りました。今後もあなたに満足いただける作品を作っていきます。",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint4":[
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"-",
			"-",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		]
	},
	"en":{
		"hint1":[
			"",
			"-",
			"A desk with a notebook and an eraser has eight buttons. It looks like there's something in the classroom that has the same shape as the button.",
			"-",
			"What do you use the triangle ruler for? This ruler has three different corners. Is there a mark indicating a corner somewhere?",
			"There is a school bag in the locker. Looks like I need to put the school bag in the right place. If you move the school bag, you might find out something.",
			"What should I use the brush I got? Speaking of doing with a brush...",
			"There are three buttons on the back of the peeled paper. All are marked with red and white markings. There must have been something red and white somewhere in the classroom.",
			"There's a desk with a world map puzzle on it. It looks like I should complete the puzzle.",
			"Above the locker are three buttons and a red-blue-green cube. There should be a cube of the same color somewhere in the classroom.",
			"It seems that each hourglass has a different time when the sand falls. Speaking of time, I feel like I've seen the word ##time## somewhere.",
			"-",
			"Use chalk to write something on the blackboard.",
			"There are number buttons on the desk near the blackboard. It seems that the number screen has lines of the same color as the lines drawn on the blackboard.",
			"There is also something like a stick to the left of the black, blue, and red buttons. There must have been something similar to this shape somewhere in the classroom.",
			"Find a place where you can use the key. For example, a door somewhere...",
			"There is a morning glory near the shoebox. If you look closely, you can see four colors of flowers blooming.",
			"Speaking of where to use toilet paper...",
			"Let's clean it with the cleaning brush you got. Is there a dirty spot somewhere?",
			"Where are the shoes that match the footprints on the bathroom floor?",
			"Find a place where you can use the key. Stairs are weird.",
			"There are four buttons on the morning glory. The button seems to represent a place on the second floor.",
			"A bag hangs on the wall in the hallway in front of the classroom on the first floor. If you look closely at the bag, you will see a round mark. I have seen this mark somewhere.",
			"I wonder if the picture on the back of the trash can represents water. Somewhere there must be water.",
			"Use pushpins to attach paper.",
			"The items in the squares have strings attached to them, so they can be hung somewhere. There should be somewhere on the second floor where you can hang it.",
			"There are two identical paintings in the hallway on the second floor. Comparing the pictures, there seems to be a difference.",
			"There are blue, red, and yellow faces on the desk near the door. The eyebrows and mouth seem to move. Something similar should be in your classroom.",
			"-",
			"-",
			"Use your compass to draw a circle somewhere. There is a circle on the desk full of blue letters. 5cm and 9cm are also written...",
			"There is an abacus in the classroom. It seems to work only in 3 places. Is there a picture somewhere that depicts an abacus? For example, in some notebook.",
			"-",
			"Let's feed the fish. Then the fish might be happy to tell you something.",
			"There are four buttons on the wall near the window. There is also a picture of a school bag and a recorder. It seems that the same thing as the picture is also in the classroom.",
			"You can put the animal you got on the desk with ##weight## drawn on it. It seems that it is necessary to arrange them in order of importance. Is there a place that expresses weight somewhere?",
			"There are three buttons in the desk drawer. Each one seems to point to something. Find the one that matches the picture.",
			"Speaking of erasing the blackboard.",
			"Move objects to make an X shape. One is the toilet on the second floor is suspicious.",
			"After that, just open the door near the shoe box and escape!",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint2":[
			"",
			"",
			"Tap the curtain to open it.",
			"",
			"A desk filled with numbers has three marks representing corners. If you put a triangle ruler here, you might know something.",
			"There seems to be letters written on the back of the locker. If you know the letters, you should know where to put the randoseru.",
			"Find a desk where you can do calligraphy. So, let's put ink on the brush and write the letters.",
			"There seems to be a doll doing gymnastics in the classroom. The doll is wearing a red and white hat.",
			"If you don't know the world map, look it up on the internet.",
			"Some lockers are stacked with cubes. The number of cubes of each color seems to be the answer. The base that the cube is on will rotate.",
			"Find the desk that says ##Time##. There are three buttons there. It seems to be good to match the color of the button in order of long time.",
			"-",
			"Using pink and yellow chalk should draw lines on the blackboard. This line also seems to represent an angle. Speaking of angles...",
			"If you look closely at the protractor you have placed, you can see the angle of each line.",
			"There is a picture of a carp streamer in the back of the classroom.",
			"You can use the key in the back door of the classroom.",
			"Each flower seems to have a different size.",
			"Some toilets don't have toilet paper. Let's set it there.",
			"The bathroom floor is black and dirty. Clean up with a cleaning brush!",
			"It looks like there are three shoes in the shoebox that match the footprints. It looks like you have to tap the shoes in the correct order.",
			"You can use the key to unlock the padlock on the stairs.",
			"The button seems to represent the entire restroom on the second floor. Pay attention to what's in place of the toilet button.",
			"The round mark can also be seen on the round part of the note. There must have been a music book somewhere in the classroom.",
			"There is a tap on the second floor. It seems that there are four faucets and there is an order to put out water.",
			"Use a push pin to stick the peeling paper in the hallway on the second floor.",
			"Let's hang items on the picture in the hallway on the 2nd floor.",
			"It seems that there are three differences. One is the balloon on the left.",
			"There is a demon near the window. It's clear when you face the same face as the demon's expression!",
			"-",
			"-",
			"There are 5cm and 9cm rulers on the desk near the blackboard. Here you can open the compass to each size. All you have to do is draw a circle on the desk with the alphabet.",
			"There is a notebook on the desk near the window. The note seems to have an orange mark drawn on it.",
			"",
			"The three fishes seem to move and represent something. You can see it in numbers.",
			"Let's pay attention to the desk where the same thing as the picture is placed.",
			"On the wall near the blackboard is a picture of an animal on a seesaw. Cows are the heaviest.",
			"The leftmost red mark represents the encircling magnet. So the far left is ##E##! Look for the other two. If you can't find it on the 2nd floor, try looking on the 1st floor as well.",
			"Use the blackboard eraser to erase graffiti on the blackboard.",
			"It seems that there is something that can make X in the classroom on the first floor.",
			"Well, it's almost time to clear!",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint3":[
			"",
			"",
			"The button represents the shape of the window. It is OK if you make the place where the window is open white.",
			"",
			"If you place a triangular ruler, the numbers will enter the ruler. Align the button with this number. The answer is ##253##.",
			"The letters represent RED and BLUE. In other words, if you place a red randoseru where there is a RED letter, and a blue randoseru where there is a BLUE letter, it will be clear!",
			"",
			"The button represents the color of the doll's hat. It is clear if you match the buttons so that it is the same color as the doll's hat.",
			"",
			"Counting the number of cubes, there are 5 blue, 3 red and 4 green. The answer is ##534##!",
			"From the time the sand of the hourglass falls, the buttons are pink, yellow, and orange from the left to clear!",
			"-",
			"Place the protractor on the drawn line and it's OK!",
			"Enter the angle of each line with the number buttons. Yellow is 50 degrees and pink is 140 degrees, so the answer is ##50140##!",
			"The button represents the number of carp streamers. If you count the number of each color, the answer is ##324## from the top!",
			"",
			"The flower button on the cleaning box in the classroom represents the size of the morning glory. The answer is ##Purple, Pink, Yellow, White## in ascending order!",
			"",
			"",
			"Clear by tapping the shoes of the same shape in order from the front to the back of the footprints!",
			"",
			"The button represents the shape of toilet paper. Upper left triangle, lower left square, upper right none, lower right triangle!",
			"Match the height of the bag to the position of the notes in a music book. The five lines are the landmark. The 3rd, 4th, 2nd, and 5th lines from the left are clear!",
			"Tap the faucet in the order of the numbers drawn in the picture OK!",
			"",
			"",
			"The other two are the bird on the right and the autumn leaves on the bottom. The door near the picture has a button with the same square. Clear by pressing the button on three places where there are mistakes in the picture!",
			"",
			"-",
			"-",
			"If you draw two circles, there should be a place where the lines overlap. Find the overlapping alphabet that the button represents. The answer is ##UFO##!",
			"It is clear if you match the abacus in the same way as the mark on the notebook.",
			"",
			"The fish seems to represent ##917##! Match the dials on the box in the locker to clear!",
			"The buttons represent the shape of the desk on which things are placed. All you have to do is match the buttons to the shape of the desk!",
			"From the seesaw picture, you can see that bears, whales, and cows are heavier in that order. Put them on the desk in this order and you're done!",
			"The button in the middle represents the world map in the classroom on the first floor. The button on the far right is the notebook and pen in the classroom on the second floor. The answer is ##EAT##!",
			"",
			"You can make 3 Xs with a toilet brush, a classroom cleaner, and an umbrella near a shoebox.",
			"Thank you for playing until the end. I made this work while feeling nostalgic when I was a child. We will continue to create works that will satisfy you.",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint4":[
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"-",
			"-",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		]
	},
	"zh_CN":{
		"hint1":[
			"",
			"-",
			"一张配有笔记本和橡皮的桌子有八个按钮。教室里好像有一个和按钮形状一样的东西。",
			"-",
			"你用三角尺做什么？这把尺子有三个不同的角。某处是否有指示拐角的标记？",
			"储物柜里有一个书包。看来我需要把书包放在正确的地方了。如果你动一下书包，你可能会发现一些东西。",
			"我收到的刷子应该用来做什么？说到用刷子做...",
			"剥离的纸背面有三个按钮。全部都标有红色和白色标记。教室里一定有一些红色和白色的东西。",
			"有一张桌子，上面有一张世界地图拼图。看来我应该完成这个谜题了。",
			"储物柜上方是三个按钮和一个红蓝绿立方体。教室里的某个地方应该有一个相同颜色的立方体。",
			"似乎每个沙漏都有不同的沙子落下的时间。说起时间，我感觉好像在哪里见过“时间”这个词。",
			"-",
			"用粉笔在黑板上写一些东西。",
			"黑板附近的桌子上有数字按钮。数字屏幕上似乎有与黑板上画的线条颜色相同的线条。",
			"黑色、蓝色和红色按钮的左侧还有一根类似棍子的东西。教室里一定有类似这个形状的东西。",
			"找到一个可以使用钥匙的地方。例如，某处的门...",
			"鞋盒旁边有一朵牵牛花。如果你仔细观察，你会看到四种颜色的花朵盛开。",
			"说到哪里可以使用卫生纸...",
			"让我们用您拥有的清洁刷清洁它。是不是有什么地方脏了？",
			"与浴室地板上的脚印相符的鞋子在哪里？",
			"找到一个可以使用钥匙的地方。楼梯很奇怪。",
			"牵牛花上有四个按钮。这个按钮似乎代表了二楼的一个地方。",
			"一楼教室前走廊的墙上挂着一个书包。如果你仔细观察袋子，你会看到一个圆形的标记。我在某处见过这个标记。",
			"我想知道垃圾桶背面的图案是否代表水。某个地方一定有水。",
			"使用图钉固定纸张。",
			"方块中的物品都附有绳子，因此可以将它们挂在某个地方。二楼应该有地方可以挂。",
			"二楼走廊里有两幅一模一样的画。对比图片，似乎还是有差距的。",
			"靠近门的桌子上有蓝色、红色和黄色的面孔。眉毛和嘴巴似乎在动。你的教室里应该有类似的东西。",
			"-",
			"-",
			"使用指南针在某处画一个圆。桌子上有一圈写满了蓝色的字母。还写着5厘米和9厘米...",
			"教室里有一个算盘。它似乎只在 3 个地方起作用。是否有一张描绘算盘的图片？例如，在某些笔记本中。",
			"-",
			"我们来喂鱼吧。那么鱼可能会很高兴告诉你一些事情。",
			"靠近窗户的墙上有四个按钮。还有一张书包和录音机的照片。教室里似乎也有和照片上一样的东西。",
			"你可以把你得到的动物放在桌子上，上面画着“重量”。看来有必要按照重要性来排列一下。有没有一个地方可以表达重量？",
			"书桌抽屉里有三个按钮。每一个似乎都指向某件事。找到与图片相符的那个。",
			"说到擦黑板。",
			"移动对象以形成 X 形状。一是二楼的厕所可疑。",
			"之后，只要打开鞋盒附近的门就可以逃跑！",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint2":[
			"",
			"",
			"点击窗帘将其打开。",
			"",
			"一张写满数字的桌子上有三个代表角的标记。如果你把三角尺放在这里，你可能会知道一些事情。",
			"储物柜的背面似乎写着字母。如果你认识这些字母，你应该知道把 randoseru 放在哪里。",
			"找一张可以写书法的桌子。那么，让我们把墨水放在毛笔上，写下字母。",
			"教室里好像有一个洋娃娃在做体操。娃娃戴着一顶红白相间的帽子。",
			"如果您不知道什么是世界地图，请在线查找。",
			"有些储物柜里堆满了立方体。每种颜色的立方体数量似乎就是答案。立方体所在的底座将会旋转。",
			"找到写着“时间”的桌子。那里有三个按钮。按照时间长的顺序来搭配按钮的颜色似乎不错。",
			"-",
			"应使用粉色和黄色粉笔在黑板上画线。这条线似乎也代表一个角度。说到角度...",
			"如果仔细观察放置的量角器，您可以看到每条线的角度。",
			"教室后面挂着鲤鱼旗的图。",
			"您可以使用教室后门的钥匙。",
			"每朵花似乎都有不同的大小。",
			"有些厕所没有卫生纸。让我们把它设置在那里。",
			"浴室地板又黑又脏。用清洁刷清洁！",
			"看起来鞋盒里有三双鞋，和脚印相符。看起来你必须按照正确的顺序敲击鞋子。",
			"您可以使用钥匙打开楼梯上的挂锁。",
			"这个按钮似乎代表了二楼的整个卫生间。注意厕所按钮的位置。",
			"在纸币的圆形部分也可以看到圆形标记。教室里一定有一本音乐书。",
			"二楼有水龙头。好像有四个水龙头，有放水的命令。",
			"用图钉将剥离纸粘在二楼走廊上。",
			"我们把照片上的物品挂在二楼走廊吧。",
			"看来有三点不同。第一个是左边的气球。",
			"窗户附近有一个恶魔。当你面对与恶魔相同的脸时，表情就一清二楚了！",
			"-",
			"-",
			"靠近黑板的桌子上有5厘米和9厘米的尺子。在这里您可以打开每个尺寸的指南针。您所要做的就是用字母在桌子上画一个圆圈。",
			"靠窗的桌子上有一本笔记本。纸条上似乎画着橙色标记。",
			"",
			"这三条鱼似乎在移动并代表着某种东西。你可以从数字中看到它。",
			"让我们注意一下桌子上放置着与图片中相同的东西。",
			"黑板附近的墙上有一张跷跷板上的动物的照片。牛是最重的。",
			"最左边的红色标记代表环形磁铁。所以最左边是“E”！寻找另外两个。如果在 2 楼找不到，也可以尝试在 1 楼寻找。",
			"使用黑板擦可以擦除黑板上的涂鸦。",
			"一楼教室里好像有能让X的东西。",
			"嗯，差不多该清场了！",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint3":[
			"",
			"",
			"该按钮代表窗口的形状。如果把窗户打开的地方变成白色就可以了。",
			"",
			"如果放置三角尺，数字就会进入三角尺。将按钮与该数字对齐。答案是“253”。",
			"这些字母代表红色和蓝色。换句话说，如果您在有红色字母的地方放置红色的randoseru，在有蓝色字母的地方放置蓝色的randoseru，就会很清楚！",
			"",
			"该按钮代表娃娃帽子的颜色。如果你将纽扣与娃娃的帽子颜色相同，就很清楚了。",
			"",
			"数一下立方体的数量，有5个蓝色、3个红色和4个绿色。答案是“534”！",
			"从沙漏的沙子落下开始，按钮从左到右依次是粉色、黄色、橙色！",
			"-",
			"将量角器放在画好的线上就OK了！",
			"使用数字按钮输入每条线的角度。黄色是50度，粉色是140度，所以答案是“50140”！",
			"按钮代表鲤鱼旗的数量。如果数一下每种颜色的数量，答案是从上往下数“324”！",
			"",
			"教室清洁箱上的花朵按钮代表牵牛花的大小。答案是“紫、粉、黄、白”（按升序排列）！",
			"",
			"",
			"通过按脚印从前到后的顺序敲击相同形状的鞋子来清除！",
			"",
			"该按钮代表卫生纸的形状。左上三角形，左下正方形，右上无，右下三角形！",
			"将包的高度与音乐书中音符的位置相匹配。这五条线是标志。左起第3、4、2、5行都清楚了！",
			"按照图中所画数字的顺序点击水龙头就OK了！",
			"",
			"",
			"另外两个是右边的鸟和底部的秋叶。图片附近的门有一个相同方块的按钮。图中有错误的三个地方按一下按钮即可清除！",
			"",
			"-",
			"-",
			"如果画两个圆，应该有线条重叠的地方。找到按钮代表的重叠字母表。答案是“UFO”！",
			"如果按照笔记本上的记号来配算盘，就很清楚了。",
			"",
			"这条鱼好像代表“917”！匹配储物柜中盒子上的刻度盘即可清除！",
			"这些按钮代表了放置物品的桌子的形状。您所要做的就是将按钮与桌子的形状相匹配！",
			"从跷跷板图片中，您可以看到熊、鲸鱼和牛的重量依次较重。按顺序将它们放在桌子上，就完成了！",
			"中间的按钮代表一楼教室的世界地图。最右边的按钮是二楼教室的笔记本和笔。答案是“吃”！",
			"",
			"您可以用马桶刷、教室清洁剂​​和鞋盒附近的雨伞制作 3 个 X。",
			"感谢您一直玩到最后。我怀着怀旧的心情创作了这部作品。我们将继续创作让您满意的作品。",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint4":[
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"-",
			"-",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		]
	},
	"es":{
		"hint1":[
			"",
			"-",
			"Un escritorio con un cuaderno y un borrador tiene ocho botones. Parece que hay algo en el salón de clases que tiene la misma forma que el botón.",
			"-",
			"¿Para qué usas la regla triangular? Esta regla tiene tres esquinas diferentes. ¿Hay una marca que indique una esquina en alguna parte?",
			"Hay una mochila escolar en el casillero. Parece que necesito poner la mochila escolar en el lugar correcto. Si mueves la mochila de la escuela, es posible que descubras algo.",
			"¿Qué debo usar el cepillo que tengo? Hablando de hacer con un pincel...",
			"Hay tres botones en la parte posterior del papel pelado. Todos están marcados con marcas rojas y blancas. Debe haber habido algo rojo y blanco en algún lugar del salón de clases.",
			"Hay un escritorio con un rompecabezas del mapa del mundo. Parece que debería completar el rompecabezas.",
			"Encima del casillero hay tres botones y un cubo rojo, azul y verde. Debe haber un cubo del mismo color en algún lugar del salón de clases.",
			"Parece que cada reloj de arena tiene un tiempo diferente cuando cae la arena. Hablando de tiempo, siento que he visto la palabra ##tiempo## en alguna parte.",
			"-",
			"Use tiza para escribir algo en la pizarra.",
			"Hay botones numéricos en el escritorio cerca de la pizarra. Parece que la pantalla de números tiene líneas del mismo color que las líneas dibujadas en la pizarra.",
			"También hay algo parecido a un palo a la izquierda de los botones negro, azul y rojo. Debe haber habido algo similar a esta forma en algún lugar del salón de clases.",
			"Encuentra un lugar donde puedas usar la llave. Por ejemplo, una puerta en algún lugar...",
			"Hay una gloria de la mañana cerca de la caja de zapatos. Si miras de cerca, puedes ver cuatro colores de flores floreciendo.",
			"Hablando de dónde usar el papel higiénico...",
			"Vamos a limpiarlo con el cepillo de limpieza que tienes. ¿Hay un lugar sucio en alguna parte?",
			"¿Dónde están los zapatos que coinciden con las huellas en el piso del baño?",
			"Encuentra un lugar donde puedas usar la llave. Las escaleras son raras.",
			"Hay cuatro botones en la gloria de la mañana. El botón parece representar un lugar en el segundo piso.",
			"Una bolsa cuelga en la pared del pasillo frente al salón de clases en el primer piso. Si miras de cerca la bolsa, verás una marca redonda. He visto esta marca en alguna parte.",
			"Me pregunto si la imagen en la parte de atrás del bote de basura representa agua. En algún lugar debe haber agua.",
			"Use chinchetas para adjuntar papel.",
			"Los artículos en los cuadrados tienen cuerdas unidas a ellos, por lo que se pueden colgar en algún lugar. Debe haber algún lugar en el segundo piso donde puedas colgarlo.",
			"Hay dos cuadros idénticos en el pasillo del segundo piso. Comparando las imágenes, parece haber una diferencia.",
			"Hay caras azules, rojas y amarillas en el escritorio cerca de la puerta. Las cejas y la boca parecen moverse. Algo similar debería estar en tu salón de clases.",
			"-",
			"-",
			"Usa tu compás para dibujar un círculo en algún lugar. Hay un círculo en el escritorio lleno de letras azules. 5cm y 9cm también se escriben...",
			"Hay un ábaco en el salón de clases. Parece funcionar solo en 3 lugares. ¿Hay alguna imagen en alguna parte que represente un ábaco? Por ejemplo, en algún cuaderno.",
			"-",
			"Alimentemos a los peces. Entonces el pez podría estar feliz de decirte algo.",
			"Hay cuatro botones en la pared cerca de la ventana. También hay una imagen de una mochila escolar y una grabadora. Parece que lo mismo que la imagen también está en el salón de clases.",
			"Puedes poner el animal que tienes en el escritorio con el ##peso## dibujado en él. Parece que es necesario ordenarlos en orden de importancia. ¿Hay algún lugar que exprese peso en alguna parte?",
			"Hay tres botones en el cajón del escritorio. Cada uno parece apuntar a algo. Encuentra el que coincida con la imagen.",
			"Hablando de borrar la pizarra.",
			"Mueve objetos para hacer una forma de X. Uno es el baño en el segundo piso es sospechoso.",
			"¡Después de eso, simplemente abre la puerta cerca de la caja de zapatos y escapa!",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint2":[
			"",
			"",
			"Toca la cortina para abrirla.",
			"",
			"Un escritorio lleno de números tiene tres marcas que representan las esquinas. Si pones una regla triangular aquí, podrías saber algo.",
			"Parece que hay letras escritas en la parte de atrás del casillero. Si conoce las letras, debe saber dónde colocar el randoseru.",
			"Encuentra un escritorio donde puedas hacer caligrafía. Entonces, pongamos tinta en el pincel y escribamos las letras.",
			"Parece que hay una muñeca haciendo gimnasia en el salón de clases. La muñeca lleva un sombrero rojo y blanco.",
			"Si no sabes qué es un mapa del mundo, búscalo en línea.",
			"Algunos casilleros están llenos de cubos. El número de cubos de cada color parece ser la respuesta. La base en la que se encuentra el cubo girará.",
			"Encuentra el escritorio que dice ##Tiempo##. Hay tres botones allí. Parece bueno hacer coincidir el color del botón en orden de tiempo.",
			"-",
			"Usando tiza rosa y amarilla debe dibujar líneas en la pizarra. Esta línea también parece representar un ángulo. Hablando de ángulos...",
			"Si miras de cerca el transportador que has colocado, puedes ver el ángulo de cada línea.",
			"Hay una foto de una serpentina de carpas en la parte de atrás del salón de clases.",
			"Puedes usar la llave en la puerta trasera del salón de clases.",
			"Cada flor parece tener un tamaño diferente.",
			"Algunos baños no tienen papel higiénico. Vamos a configurarlo allí.",
			"El suelo del baño está negro y sucio. ¡Limpia con un cepillo de limpieza!",
			"Parece que hay tres zapatos en la caja de zapatos que coinciden con las huellas. Parece que tienes que tocar los zapatos en el orden correcto.",
			"Puedes usar la llave para abrir el candado en las escaleras.",
			"El botón parece representar todo el baño del segundo piso. Preste atención a lo que está en lugar del botón del inodoro.",
			"La marca redonda también se puede ver en la parte redonda del billete. Debe haber habido un libro de música en algún lugar del salón de clases.",
			"Hay un grifo en el segundo piso. Parece que hay cuatro grifos y hay una orden de apagar el agua.",
			"Usa una chincheta para pegar el papel pelado en el pasillo del segundo piso.",
			"Cuelguemos artículos en la imagen en el pasillo en el segundo piso.",
			"Parece que hay tres diferencias. Uno es el globo de la izquierda.",
			"Hay un demonio cerca de la ventana. ¡Está claro cuando te enfrentas a la misma cara que la expresión del demonio!",
			"-",
			"-",
			"Hay reglas de 5 cm y 9 cm en el escritorio cerca de la pizarra. Aquí puede abrir la brújula a cada tamaño. Todo lo que tienes que hacer es dibujar un círculo en el escritorio con el alfabeto.",
			"Hay un cuaderno en el escritorio cerca de la ventana. La nota parece tener una marca naranja dibujada.",
			"",
			"Los tres peces parecen moverse y representar algo. Puedes verlo en números.",
			"Prestemos atención al escritorio donde se coloca lo mismo que la imagen.",
			"En la pared cerca de la pizarra hay una imagen de un animal en un balancín. Las vacas son las más pesadas.",
			"La marca roja más a la izquierda representa el imán circundante. ¡Así que el extremo izquierdo es ##E##! Busca los otros dos. Si no puede encontrarlo en el segundo piso, intente buscar también en el primer piso.",
			"Utilice el borrador de pizarra para borrar graffiti en la pizarra.",
			"Parece que hay algo que puede hacer X en el aula del primer piso.",
			"¡Bueno, ya casi es hora de despejarse!",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint3":[
			"",
			"",
			"El botón representa la forma de la ventana. Está bien si hace que el lugar donde la ventana esté abierta sea blanco.",
			"",
			"Si coloca una regla triangular, los números entrarán en la regla. Alinee el botón con este número. La respuesta es ##253##.",
			"Las letras representan ROJO y AZUL. En otras palabras, si coloca un randoseru rojo donde hay una letra ROJA y un randoseru azul donde hay una letra AZUL, ¡será claro!",
			"",
			"El botón representa el color del gorro de la muñeca. Está claro si haces coincidir los botones para que sea del mismo color que el gorro de la muñeca.",
			"",
			"Contando el número de cubos, hay 5 azules, 3 rojos y 4 verdes. ¡La respuesta es ##534##!",
			"¡Desde el momento en que cae la arena del reloj de arena, los botones son de color rosa, amarillo y naranja de la izquierda a claro!",
			"-",
			"Coloque el transportador en la línea dibujada y ¡está bien!",
			"Introduzca el ángulo de cada línea con los botones numéricos. El amarillo es 50 grados y el rosa es 140 grados, ¡así que la respuesta es ##50140##!",
			"El botón representa el número de serpentinas de carpa. Si cuenta el número de cada color, ¡la respuesta es ##324## desde arriba!",
			"",
			"El botón de la flor en la caja de limpieza en el salón de clases representa el tamaño de la gloria de la mañana. ¡La respuesta es ##Púrpura, Rosa, Amarillo, Blanco## en orden ascendente!",
			"",
			"",
			"¡Despeje tocando los zapatos de la misma forma en orden desde el frente hasta la parte posterior de las huellas!",
			"",
			"El botón representa la forma del papel higiénico. ¡Triángulo superior izquierdo, cuadrado inferior izquierdo, ninguno superior derecho, triángulo inferior derecho!",
			"Haga coincidir la altura de la bolsa con la posición de las notas en un libro de música. Las cinco líneas son el hito. ¡Las líneas 3, 4, 2 y 5 desde la izquierda son claras!",
			"Toque el grifo en el orden de los números dibujados en la imagen ¡OK!",
			"",
			"",
			"Los otros dos son el pájaro de la derecha y las hojas de otoño en la parte inferior. La puerta cerca de la imagen tiene un botón con el mismo cuadrado. ¡Despeje presionando el botón en tres lugares donde hay errores en la imagen!",
			"",
			"-",
			"-",
			"Si dibuja dos círculos, debe haber un lugar donde las líneas se superpongan. Encuentra el alfabeto superpuesto que representa el botón. ¡La respuesta es ##OVNI##!",
			"Está claro si hace coincidir el ábaco de la misma manera que la marca en el cuaderno.",
			"",
			"¡El pez parece representar ##917##! ¡Haz coincidir los diales en la caja del casillero para despejar!",
			"Los botones representan la forma del escritorio sobre el que se colocan las cosas. ¡Todo lo que tienes que hacer es hacer coincidir los botones con la forma del escritorio!",
			"De la imagen del balancín, puedes ver que los osos, las ballenas y las vacas son más pesados ​​en ese orden. Póngalos en el escritorio en este orden y ¡listo!",
			"El botón en el medio representa el mapa del mundo en el salón de clases en el primer piso. El botón en el extremo derecho es el cuaderno y el bolígrafo en el salón de clases en el segundo piso. ¡La respuesta es ##COMER##!",
			"",
			"Puedes hacer 3 X con un cepillo de baño, un limpiador de aula y un paraguas cerca de una caja de zapatos.",
			"Gracias por jugar hasta el final. Hice este trabajo mientras sentía nostalgia cuando era niño. Seguiremos creando obras que te satisfagan.",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint4":[
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"-",
			"-",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		]
	},
	"ko":{
		"hint1":[
			"",
			"-",
			"노트북과 지우개가 있는 책상에는 8개의 버튼이 있습니다. 버튼과 같은 형태의 것이 교실의 어딘가에 있는 것 같다.",
			"-",
			"삼각 눈금자는 무엇에 사용하자. 이 눈금자는 3개의 모서리가 전부 다른 형태를 하고 있군요. 어딘가에 모서리를 나타내는 마크가 없을까.",
			"사물함에는 랜드셀이 있다. 랜드셀을 올바른 장소에 둘 필요가 있는 것 같다. 랜드셀을 움직여 보면 뭔가 알지도.",
			"얻은 붓은 무엇에 사용하자. 붓으로 한다고 하면・・・",
			"벗겨진 종이 뒤에는 버튼이 3개 있다. 모두 빨간색과 흰색 마크가 그려져 있습니다. 빨간색과 흰색 물건이 교실의 어딘가에 있었을 것입니다.",
			"세계지도 퍼즐이 놓여 있는 책상이 있네요. 퍼즐을 완성시키면 좋을 것 같다.",
			"사물함 위에는 세 개의 버튼과 빨간색 청록색 큐브가 있습니다. 같은 색의 큐브가 교실의 어딘가에도 있을 것이다.",
			"모래 시계는 각각 모래가 떨어지는 시간이 다른 것 같네요. 시간이라고 하면 어딘가에서 ##시간##이라는 문자를 본 생각이 든다.",
			"-",
			"분필을 사용하여 칠판에 뭔가 쓰자.",
			"칠판 근처의 책상에는 숫자 버튼이 있습니다. 숫자의 화면에는 칠판에 그린 선과 같은 색의 선이 있는 것 같네요.",
			"검은색, 파란색, 빨간색 버튼의 왼쪽에는 막대기 같은 것도 있다. 이 형태와 같은 것이 교실의 어딘가에도 있었을 것.",
			"열쇠를 사용할 수 있는 곳을 찾아보자. 예를 들어, 어딘가의 문이라든지・・・",
			"신발 상자 근처에는 나팔꽃이 있어. 잘 보면 4 색의 꽃이 피고 있습니다.",
			"화장지를 사용하는 장소라고 하면・・・",
			"얻은 청소 브러시로 청소해 보자. 어딘가에 더러운 곳이 없을까.",
			"화장실 바닥에 있는 발자국과 같은 신발이 어딘가에 없을까.",
			"열쇠를 사용할 수 있는 곳을 찾으자. 계단 근처가 수상하다.",
			"나팔꽃 위에는 버튼이 4개 있다. 버튼은 2층이 있는 장소를 나타내고 있는 것 같다.",
			"1층 교실 앞 복도에는 가방이 벽에 걸려 있다. 가방을 잘 보면 둥근 마크가 그려져 있네요. 이 마크 어딘가에서 본 것 같습니다.",
			"쓰레기통 뒤에 있는 그림은 물을 나타내고 있는 것일까. 물이 있는 곳이 어딘가에 있을 것이다.",
			"푸시 핀은 종이를 붙이는 데 사용해 보자.",
			"매스 눈의 아이템은 끈이 붙어 어딘가에 걸릴 것 같다. 걸 수 있는 장소가 2층의 어딘가에 있을 것.",
			"2층의 복도에는 같은 2개의 그림이 있군요. 그림을 봐 비교하면 다른 곳이 있는 것 같다.",
			"문 근처의 책상에는 파란색, 빨간색, 노란색 얼굴이 있네요. 눈썹과 입이 움직이는 것 같다. 비슷한 것이 교실의 어딘가에도 있을 것.",
			"-",
			"-",
			"나침반을 사용하여 어딘가에 원을 그립니다. 청색 알파벳이 가득한 책상에는 원이 있네요. 5cm와 9cm도 적혀 있지만 ...",
			"교실에는 주판이 있네요. 3곳만 움직이는 것 같다. 주판을 나타내는 그림이 어딘가에 없을까. 예를 들어 어딘가의 메모에.",
			"-",
			"물고기에 먹이를 줘 보자. 그러면 물고기가 기뻐하고 뭔가를 가르쳐 줄지도.",
			"창 근처의 벽에는 버튼이 4개 있다. 랜드 셀과 약간 리코더의 그림도 있군요. 그림과 같은 것이 교실에도 있는 것 같다.",
			"##오모사##라고 그려진 책상에는 겟한 동물을 둘 수 있어요. 무거운 순서로 늘어놓을 필요가 있는 것 같다. 어딘가에 맛을 나타내는 곳이 없을까.",
			"책상 서랍에는 버튼이 3개 있다. 각각 무언가로 가리키고 있는 것 같다. 그림과 같은 것을 찾으십시오.",
			"칠판 지우는 것이라고 하면.",
			"물건을 움직여 X 모양을 만들어 보자. 하나는 2층의 화장실이 수상하다.",
			"그리고는 신발 상자 근처의 문을 열고 탈출할 뿐!",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint2":[
			"",
			"",
			"커튼을 탭하면 열 수 있습니다.",
			"",
			"숫자가 가득 쓰여진 책상에는 모서리를 나타내는 마크가 3개 있다. 여기에 삼각 눈금자를 두면 무엇인지 알지도.",
			"로커 안쪽에는 문자가 쓰여 있는 것 같다. 문자를 알면 란도셀이 둘 곳을 알 수 있을 것이다.",
			"습자가 가능한 책상을 찾으자. 거기서 붓에 묵즙을 붙여, 문자를 써 보자.",
			"교실에는 조체조를 하고 있는 인형이 있는 것 같다. 인형은 빨간색과 흰색 모자를 쓰고 있습니다.",
			"세계지도를 모르는 사람은 인터넷으로 조사해 보자.",
			"사물함에는 큐브가 쌓여 있는 곳이 있군요. 각 색상의 큐브 수가 대답처럼 보입니다. 큐브가 타고 있는 토대는 회전한다.",
			"##시간##이라고 적혀 있는 책상을 찾아내자. 거기에는 버튼이 3개 있다. 시간이 긴 차례로 버튼의 색을 맞추면 좋다.",
			"-",
			"핑크와 노란색 초크를 사용하면 칠판에 선이 그려질 것이다. 이 선은 각도를 나타내는 것처럼 보입니다. 각도라고 ​​하면・・・",
			"놓은 각도기를 잘 보면 각 선의 각도를 알 수 있습니다.",
			"교실의 뒤쪽에는 이노보리의 그림이 있어.",
			"열쇠는 교실 뒤의 문에서 사용할 수 있습니다.",
			"꽃은 각각 크기도 다른 것 같다.",
			"화장실에는 화장지가 없는 곳이 있어. 거기에 세트 해 주자.",
			"화장실 바닥은 검은 색으로 더러워졌습니다. 청소 브러시로 청소하자!",
			"신발 상자에 발자국과 같은 3개의 신발이 있는 것 같다. 신발을 올바른 순서로 탭하지 않으면 안되는 것 같네요.",
			"열쇠로 계단에 있는 자물쇠를 해정할 수 있어.",
			"버튼은 2층의 화장실 전체를 나타내는 것 같다. 화장실 버튼의 위치에 있는 것에 주목해 보자.",
			"둥근 마크는 음표의 둥근 부분에도 보이네요. 음악 책이 교실의 어딘가에 있었을 것입니다.",
			"2층에는 수도가 있다. 수도꼭지가 4개 있어 물을 내는 순서가 있는 것 같다.",
			"2층의 복도에 있는 벗겨진 종이를 눌러 핀으로 붙여 주자.",
			"2층 복도 그림에 아이템을 걸어 보자.",
			"다른 곳은 3개 있는 것 같다. 하나는 왼쪽의 풍선이군요.",
			"창 근처에는 악마가 있습니다. 귀신의 표정과 같이 얼굴을 맞추면 클리어다!",
			"-",
			"-",
			"칠판 근처의 책상에는 5cm와 9cm의 통치자가 있다. 여기서 나침반을 각각의 크기로 열 수 있어요. 그리고는 알파벳이 있는 책상에 원을 그릴 뿐.",
			"창 근처의 책상에는 노트북이 있습니다. 노트에는 오렌지색 마크가 그려져 있는 것 같다.",
			"",
			"3마리의 물고기는 움직여 무언가를 나타내는 것 같다. 숫자도 보이네요.",
			"그림과 같은 물건이 놓여 있는 책상에 주목해 보자.",
			"칠판 근처의 벽에는 동물이 시소를 타고 있는 그림이 있네요. 가장 무거운 것은 소처럼 보인다.",
			"가장 왼쪽의 빨간색 마크는 포위 자석을 나타냅니다. 즉 가장 왼쪽은 ##E##다! 다른 두 가지를 찾아 보자. 2층에서 발견되지 않을 때는 1층도 찾아보자.",
			"칠판 지우기를 사용하여 칠판 낙서를 지우자.",
			"1층 교실에도 X를 만들 수 있는 물건이 있는 것 같다.",
			"자 클리어는 곧!",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint3":[
			"",
			"",
			"버튼은 창 모양을 나타냅니다. 창문이 열려 있는 곳을 흰색으로 하면 OK.",
			"",
			"삼각 눈금자를 놓으면 눈금자 안에 숫자가 들어가네요. 이 숫자에 버튼을 맞추자. 대답은 ##253##이군요.",
			"문자는 RED와 BLUE를 나타냅니다. 즉, RED의 문자가 있는 곳에 붉은 란도셀을, BLUE의 글자가 있는 곳에 파란 란도셀을 놓으면 클리어다!",
			"",
			"버튼은 인형의 모자의 색을 나타내고 있어. 인형 모자와 같은 색이 되도록 버튼을 맞추면 클리어다.",
			"",
			"큐브의 수를 세면 파란색이 5개, 빨간색이 3개, 녹색이 4개. 대답은 ##534##다!",
			"모래 시계의 모래가 떨어지는 시간보다, 버튼은 왼쪽에서 핑크, 옐로우, 오렌지색으로 하면 클리어다!",
			"-",
			"그린 선 곳에 각도기를 두면 OK!",
			"각 선의 각도를 숫자 버튼으로 입력합시다. 노란색은 50도, 핑크는 140도이기 때문에 대답은 ##50140##이다!",
			"버튼은 코이노보리의 수를 나타내고 있어. 각각의 색의 수를 세면 대답은 위로부터 「324」이다!",
			"",
			"교실의 청소 상자에 있는 꽃의 버튼은 나팔꽃의 크기를 나타내고 있어. 작은 순서에 「보라색, 핑크, 노란색, 흰색」이 대답이다!",
			"",
			"",
			"발자국 앞에서 안쪽 순서에 같은 형태의 신발을 탭 해 가면 클리어다!",
			"",
			"버튼은 화장지의 형태를 나타냅니다. 좌상이 삼각, 좌하가 사각형, 우상은 없음, 우하는 삼각이다!",
			"음악 책의 노트 위치와 같이 부대의 고도를 맞추자. 5개의 선이 표지군요. 왼쪽에서 세 번째 라인, 네 번째 라인, 두 번째 라인, 다섯 번째 라인으로 클리어!",
			"그림에 그려진 숫자의 순서로 수도꼭지를 탭하면 OK!",
			"",
			"",
			"나머지 2개는 오른쪽의 새와 하단의 단풍이군요. 그림 근처의 문에는 같은 매스 눈의 버튼이 있어. 그림의 실수가 있는 3개의 장소를 버튼으로 누르면 클리어다!",
			"",
			"-",
			"-",
			"원을 2개 그리면 선이 겹치는 장소가 있을 것이다. 버튼이 나타내는 중첩 부분의 알파벳을 찾으십시오. 대답은 ##UFO##다!",
			"노트의 마크와 같이 주판을 맞추면 클리어다.",
			"",
			"물고기는 ##917##을 나타내는 것 같다! 로커에 있는 상자의 다이얼을 맞추면 클리어다!",
			"버튼은 물건이 놓여있는 책상 모양을 나타냅니다. 책상 모양에 버튼을 맞추면 OK!",
			"시소의 그림에서 곰, 고래, 소의 순서에 무거운 것을 알 수 있습니다. 이 순서로 책상에 놓으면 클리어다!",
			"중간의 버튼은 1층의 교실에 있는 세계 지도를 나타내고 있어. 제일 오른쪽의 버튼은 2층의 교실의 노트와 펜이군요. 대답은 ##EAT##다!",
			"",
			"화장실 브러시, 교실 청소 상자, 신발 상자 근처 우산으로 X를 3개 만들 수 있군요.",
			"끝까지 플레이 해 주셔서 감사합니다. 어린 시절의 그리운 기분이 되면서 본 작품을 만들었습니다. 앞으로도 당신에게 만족하실 작품을 만들어 갈 것입니다.",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		],
		"hint4":[
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"-",
			"-",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			""
		]
	}
}